entries/rust-euler-1/index.html
<!DOCTYPE html>
<html>
    <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <title>hudat</title>
    <meta name="viewport" content="width=device-width">
    <meta name="description" content="Nebby about Tech">
    <link rel="canonical" href="http://joelmccracken.github.io/entries/rust-euler-1/">

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/css/main.css">

</head>

    <body>

        <header class="site-header">

  <div class="wrap">

    <a class="site-title" href="/">Joel's Journal</a>

    <nav class="site-nav">
      <a href="#" class="menu-icon">
        <svg version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
           viewBox="0 0 18 15" enable-background="new 0 0 18 15" xml:space="preserve">
          <path fill="#505050" d="M18,1.484c0,0.82-0.665,1.484-1.484,1.484H1.484C0.665,2.969,0,2.304,0,1.484l0,0C0,0.665,0.665,0,1.484,0
            h15.031C17.335,0,18,0.665,18,1.484L18,1.484z"/>
          <path fill="#505050" d="M18,7.516C18,8.335,17.335,9,16.516,9H1.484C0.665,9,0,8.335,0,7.516l0,0c0-0.82,0.665-1.484,1.484-1.484
            h15.031C17.335,6.031,18,6.696,18,7.516L18,7.516z"/>
          <path fill="#505050" d="M18,13.516C18,14.335,17.335,15,16.516,15H1.484C0.665,15,0,14.335,0,13.516l0,0
            c0-0.82,0.665-1.484,1.484-1.484h15.031C17.335,12.031,18,12.696,18,13.516L18,13.516z"/>
        </svg>
      </a>
      <div class="trigger">
        <a class="page-link" href="/about">About</a>
        <a class="page-link" href="/projects">Projects</a>
      </div>
    </nav>

  </div>

</header>

        <div class="page-content">
            <div class="wrap">
                <div class="post">
                    <header class="post-header">
                        <h1>hudat</h1>
                        <p class="meta">May 18, 2016</p>
                    </header>

                    <article class="post-content">
                        <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. First Try</a></li>
<li><a href="#sec-2">2. Adding a HOF</a></li>
<li><a href="#sec-3">3. Peano numbers?</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> First Try</h2>
<div class="outline-text-2" id="text-1">
<p>
Right now, I'm at that stage where I'm still not quite there with
Rust. I can do things, but I tend to get stuck, and I know
</p>


<p>
So, in order to keep interest and my momentum, I've been looking for
some small challenges. Project Euler seems perfect.
</p>

<p>
This first challenge is straightforward. Create a range, sum a
variable, and use the modulo operator. I came up with this solution
almost right away:
</p>

<pre class="example">
fn main() {
    let mut total = 0;
    for i in 1..1_000 {
        if is_addable(i) {
            total += i
        }
    }
    println!("{}", total);
}

fn is_addable(x: i64) -&gt; bool {
    (x % 3) == 0 || (x % 5) == 0
}
</pre>

<p>
The documentation for the <code>1..1_000</code> form is here:
<a href="http://doc.rust-lang.org/std/ops/struct.Range.html">http://doc.rust-lang.org/std/ops/struct.Range.html</a>.
It was a little hard to find. I think this is because the most
prominent thing on the page shows the <code>struct</code> definition, but the
actual operators aren't really around.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Adding a HOF</h2>
<div class="outline-text-2" id="text-2">
<p>
That was great, but I'm really interested in doing things
functionally. Can I <code>filter</code> the range, and then maybe <code>sum</code>?
</p>

<p>
After a little bit of fiddling, this is what I came up with:
</p>

<pre class="example">
fn main() {
    let total = (1..1_000).filter(|i| is_addable(*i)).
        fold(0, |acc, i| acc + i);
    println!("{:?}", total);
}

fn is_addable(x: i64) -&gt; bool {
    (x % 3) == 0 || (x % 5) == 0
}
</pre>

<p>
Can I make this any better? I notice that the lambda around is<sub>addable</sub>
seems unnecessary:
</p>

<pre class="example">
fn main() {
    let total = (1..1_000).filter(is_addable).
        fold(0, |acc, i| acc + i);
    println!("{:?}", total);
}

fn is_addable(x: &amp;i64) -&gt; bool {
    (x % 3) == 0 || (x % 5) == 0
}
</pre>

<p>
Great, it still works.
</p>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Peano numbers?</h2>
<div class="outline-text-2" id="text-3">
<p>
OK, this is a real stretch goal, but I'm feeling good about myself
because this all went pretty well.
</p>

<p>
I've always been a little bit intrigued by Peano numbers. You might
object that they're very slow &#x2013; they are &#x2013; but, I think they are
still interesting in terms of being conceptually very simple.
</p>

<p>
The other things is that I know Peano numbers will require some memory
management, which is something I want to exercise.
</p>


<p>
We start with the Peano enum:
</p>


<p>
enum Peano {
    Zero,
    Succ(Box&lt;Peano&gt;)
}
</p>


<p>
You might notice that this is almost the same as various Rust List
tutorials around. The <code>Box</code> call is for the same reason: Rust needs.
</p>
</div>
</div>

                    </article>

                    <div id="disqus_thread"></div>
                    <script>
                     var disqus_shortname = 'joelmccracken'; // required: replace example with your forum shortname

                     var disqus_config = function () {
                         this.page.url = "http://joelmccracken.github.io/entries/rust-euler-1/";
                         this.page.identifier = "/entries/rust-euler-1";
                         this.page.title = "hudat";
                     };

                     (function() {  // REQUIRED CONFIGURATION VARIABLE: EDIT THE SHORTNAME BELOW
                         var d = document, s = d.createElement('script');

                         s.src = '//'+disqus_shortname+'.disqus.com/embed.js';  // IMPORTANT: Replace EXAMPLE with your forum shortname!
                         s.setAttribute('data-timestamp', +new Date());
                         (d.head || d.body).appendChild(s);
                     })();
                    </script>
                    <noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a></noscript>
                </div>
            </div>
        </div>

        <footer class="site-footer">

  <div class="wrap">

    <h2 class="footer-heading">Joel McCracken</h2>

    <div class="footer-col-1 column">
      <ul>
        <li><a href="mailto:mccracken.joel@gmail.com">mccracken.joel@gmail.com</a></li>
      </ul>
    </div>

    <div class="footer-col-2 column">
      <ul>
        <li>
          <a href="https://github.com/JoelMcCracken">
            <span class="icon github">
              <svg version="1.1" class="github-icon-svg" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                 viewBox="0 0 16 16" enable-background="new 0 0 16 16" xml:space="preserve">
                <path fill-rule="evenodd" clip-rule="evenodd" fill="#C2C2C2" d="M7.999,0.431c-4.285,0-7.76,3.474-7.76,7.761
                c0,3.428,2.223,6.337,5.307,7.363c0.388,0.071,0.53-0.168,0.53-0.374c0-0.184-0.007-0.672-0.01-1.32
                c-2.159,0.469-2.614-1.04-2.614-1.04c-0.353-0.896-0.862-1.135-0.862-1.135c-0.705-0.481,0.053-0.472,0.053-0.472
                c0.779,0.055,1.189,0.8,1.189,0.8c0.692,1.186,1.816,0.843,2.258,0.645c0.071-0.502,0.271-0.843,0.493-1.037
                C4.86,11.425,3.049,10.76,3.049,7.786c0-0.847,0.302-1.54,0.799-2.082C3.768,5.507,3.501,4.718,3.924,3.65
                c0,0,0.652-0.209,2.134,0.796C6.677,4.273,7.34,4.187,8,4.184c0.659,0.003,1.323,0.089,1.943,0.261
                c1.482-1.004,2.132-0.796,2.132-0.796c0.423,1.068,0.157,1.857,0.077,2.054c0.497,0.542,0.798,1.235,0.798,2.082
                c0,2.981-1.814,3.637-3.543,3.829c0.279,0.24,0.527,0.713,0.527,1.437c0,1.037-0.01,1.874-0.01,2.129
                c0,0.208,0.14,0.449,0.534,0.373c3.081-1.028,5.302-3.935,5.302-7.362C15.76,3.906,12.285,0.431,7.999,0.431z"/>
              </svg>
            </span>
            <span class="username">JoelMcCracken</span>
          </a>
        </li>
        <li>
          <a href="https://twitter.com/JoelMcCracken">
            <span class="icon twitter">
              <svg version="1.1" class="twitter-icon-svg" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                 viewBox="0 0 16 16" enable-background="new 0 0 16 16" xml:space="preserve">
                <path fill="#C2C2C2" d="M15.969,3.058c-0.586,0.26-1.217,0.436-1.878,0.515c0.675-0.405,1.194-1.045,1.438-1.809
                c-0.632,0.375-1.332,0.647-2.076,0.793c-0.596-0.636-1.446-1.033-2.387-1.033c-1.806,0-3.27,1.464-3.27,3.27
                c0,0.256,0.029,0.506,0.085,0.745C5.163,5.404,2.753,4.102,1.14,2.124C0.859,2.607,0.698,3.168,0.698,3.767
                c0,1.134,0.577,2.135,1.455,2.722C1.616,6.472,1.112,6.325,0.671,6.08c0,0.014,0,0.027,0,0.041c0,1.584,1.127,2.906,2.623,3.206
                C3.02,9.402,2.731,9.442,2.433,9.442c-0.211,0-0.416-0.021-0.615-0.059c0.416,1.299,1.624,2.245,3.055,2.271
                c-1.119,0.877-2.529,1.4-4.061,1.4c-0.264,0-0.524-0.015-0.78-0.046c1.447,0.928,3.166,1.469,5.013,1.469
                c6.015,0,9.304-4.983,9.304-9.304c0-0.142-0.003-0.283-0.009-0.423C14.976,4.29,15.531,3.714,15.969,3.058z"/>
              </svg>
            </span>
            <span class="username">JoelMcCracken</span>
          </a>
        </li>
      </ul>
    </div>

    <!-- 
    <div class="footer-col-3 column">
      <p class="text">would like to add some rotating content down here</p>
    </div>
    -->
  </div>

</footer>


        <script type="text/javascript">
 var _gaq = _gaq || [];
 _gaq.push(['_setAccount', 'UA-7759066-1']);
 _gaq.push(['_trackPageview']);

 (function() {
   var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
   ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
   var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
 })();
</script>

    </body>
</html>
